[{"name":"Documentation","description":"This is the documentation","path":"/documentation","text":"","wordCount":0,"tags":[],"type":"TOC"},{"name":"Frequently Asked Questions","description":"A collection of frequently asked questions.","owner":"","path":"/documentation/faq","text":"\nGeneral\n\nQ: What is [product name]?\nA: [Answer to the question]\n\nQ: Who can use [product name]?\nA: [Answer to the question]\n\nQ: How do I get started with [product name]?\nA: [Answer to the question]\n\nFeatures\n\nQ: How does [feature name] work?\nA: [Answer to the question]\n\nQ: What are the benefits of using [feature name]?\nA: [Answer to the question]\n\nQ: Can I customize [feature name]?\nA: [Answer to the question]\n\nPricing\n\nQ: How much does [product name] cost?\nA: [Answer to the question]\n\nQ: What payment methods do you accept?\nA: [Answer to the question]\n\nQ: Is there a free trial?\nA: [Answer to the question]\n\nSupport\n\nQ: How do I get support for [product name]?\nA: [Answer to the question]\n\nQ: What is your response time for support requests?\nA: [Answer to the question]\n\nQ: Can I request a feature or suggest an improvement?\nA: [Answer to the question]\n","wordCount":126,"tags":["questions"],"type":"Content"},{"name":"Useful Links","description":"Helpful links that you will use often.","owner":"","path":"/documentation/links","text":"\nLearning Resources\n\nCodecademy\nFreeCodeCamp\nKhan Academy\nUdacity\n\nWeb Development\n\nHTML/CSS\n\nW3Schools\nMDN Web Docs\n\nJavaScript\n\nJavaScript.info\nEloquent JavaScript\nMDN Web Docs\n\nFrameworks\n\nReact\nVue\nAngular\n\nDesign\n\nCanva\nFigma\nAdobe XD\n\nTools\n\nGitHub\nGitLab\nVisual Studio Code\nAtom\nSublime Text\n","wordCount":13,"tags":[],"type":"Content"},{"name":"Process","description":"","path":"/documentation/Process","text":"","wordCount":0,"tags":[],"type":"TOC"},{"name":"Install VS Code","description":"How to install Visual Studio Code.","owner":"","path":"/documentation/Process/installing vs code","text":"\nDownload VS Code - Download the installer for your operating system from the official VS Code website.\n\nRun the Installer - Run the installer and follow the prompts to complete the installation process. If you encounter any issues during the installation, refer to the installation troubleshooting guide.\n\nLaunch VS Code - After the installation is complete, launch VS Code by opening the application from your system's applications menu or by clicking the desktop shortcut.\n\nInstall Extensions - VS Code has a large and growing library of extensions that can enhance your coding experience. To install extensions, open the Extensions panel by clicking on the Extensions icon in the left-hand sidebar or by pressing Ctrl + Shift + X (Windows/Linux) or Cmd + Shift + X (macOS). Search for the extension you want to install and click the Install button.\n\nCongratulations, you have successfully installed Visual Studio Code!\n","wordCount":143,"tags":["code"],"type":"Content"},{"name":"Raise A Pull Request in Github","description":"Process documentation for how to raise a pull request in GitHub.","owner":"","path":"/documentation/Process/raising a pull request in github","text":"\nFork the Repository - Fork the repository you want to make changes to, by clicking the \"Fork\" button in the top-right corner of the repository page. This will create a copy of the repository in your own GitHub account.\n\nClone the Forked Repository - Once you've forked the repository, clone it to your local machine using git clone https://github.com/your-username/repo-name.git. This will download a copy of the repository to your local machine.\n\nCreate a New Branch - Create a new branch to work on your changes using git checkout -b new-branch-name. This will create a new branch and switch to it. You should always create a new branch to work on changes, so that you don't accidentally break the main branch.\n\nMake Changes - Make the necessary changes to the code or documentation in the repository. Be sure to follow the project's conventions,\n\n    Add your changes\n    Commit your changes using git commit -m \"your commit message\". This will create a new commit with your changes.\n\nPush Changes to GitHub - Push your changes to GitHub using git push origin new-branch-name. This will push your changes to your forked repository on GitHub.\n\nCreate a Pull Request - Go to the original repository on GitHub and click the \"New Pull Request\" button. Select your forked repository and the new branch you created. Add a description of your changes and click \"Create Pull Request\".\n\nDiscuss and Merge - Discuss your changes with the project maintainers and make any necessary changes. Once your changes have been approved, the project maintainer can merge your changes into the main branch.\n\nCongratulations, you've successfully raised a pull request in GitHub using Markdown!\n","wordCount":266,"tags":["pull-request","code"],"type":"Content"}]